e-bike/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(front|back)"
    {
        type            zeroGradient;
    }

    left
    {
        type            calculated;
        value           uniform 0;
    }

    right
    {
        type            calculated;
        value           uniform 0;
    }

    bottom 
    {
        type            nutkWallFunction;	//nutUSpaldingWallFunction;
        value           uniform 0;
    }
    
     top
    {
        type            zeroGradient;
    }


    ebike
    {
        type            nutkWallFunction;	//nutUSpaldingWallFunction;
        value           uniform 0;
    }

    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
