e-bike/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
     (-4 7 -0.35) 	//0
     (4 7 -0.35) 	//1
     (4 7 3) 	//2
     (-4 7 3)  	//3
     (-4 -4 -0.35) 	//4
     (4 -4 -0.35)	//5	
     (4 -4 3)	//6
     (-4 -4 3)	//7
);

blocks
(
   //x=7.25,  y=5.15,  z=8.5
   //dx= x/nx= 10/7.25= 1.379
   //dy= y/ny= 10/5.15= 1.941
   //dz= z/nz= 10/8.5= 1.176
   //hex (0 1 2 3 4 5 6 7) (72 51 85) simpleGrading (1 1 1)	//dx= dy= dz= 0.1
   hex (0 1 2 3 4 5 6 7) (30 30 30) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    right
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    back
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    front
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
    top
        {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
);


// ************************************************************************* //
